# ================================
# = Texts for common handlers =
# ================================

HELLO = "Привет, {username}! 🥰\n\n"\
    "Я - бот для создания списка желаний для пары. 💖\n\n"\
    "Я помогу вам сохранить ваши желания в одном месте (здесь)\n\n"\
    "Чтобы начать, просто мне ссылку на товар, который вам нравится 👍🏻\n\n"\
    "Я буду рад помочь вам! 😘"


# ================================
# = Texts for error handlers =
# ================================

INVALID_URL = "Неверная ссылка. Пожалуйста, попробуйте еще раз. 😔"


# ================================
# = Texts for product adding =
# ================================

PRODUCT_ATTRS_ENTER = "Введите параметры товара: 👇🏻"
PRODUCT_NAME_ENTER = "Введите название товара: 👇🏻"
PRODUCT_PRICE_ENTER = "Введите цену товара в рублях: 👇🏻"
PRODUCT_PRIORITY_ENTER = "Выберите приоритет товара: 👇🏻"